src/config/Documents/ПереводТовараВУценку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>ПереводТовараВУценку</Name>
			<BasedOn>
				<xr:Item>Document.ВозвратТоваровОтПокупателя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийСклад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дефект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДефектовДляУценки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураУценка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комплектация</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.КомплектацияНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/config/Documents/ПереводТовараВУценку/Ext/ObjectModule.bsl
Процедура ПередУдалением(Отказ)
	Для каждого стр из Товары Цикл
		Если ЗначениеЗаполнено(стр.Комплектация) Тогда	
			Док = Стр.Комплектация.ПолучитьОбъект();
			Док.УстановитьПометкуУдаления(Истина);
			Док.Записать(РежимЗаписиДокумента.Запись);
		конецЕсли;	
	конецЦикла;	

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Для каждого стр из Товары Цикл
		Если ЗначениеЗаполнено(стр.Комплектация) Тогда	
			Док = Стр.Комплектация.ПолучитьОбъект();
			Док.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		конецЕсли;	
	конецЦикла;	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если пометкаУдаления Тогда
		Для каждого стр из Товары Цикл
			Если ЗначениеЗаполнено(стр.Комплектация) Тогда	
				Если не стр.Комплектация.ПометкаУдаления Тогда
				Док = Стр.Комплектация.ПолучитьОбъект();
				Док.УстановитьПометкуУдаления(Истина);
				Док.Записать(РежимЗаписиДокумента.Запись);
				конецесли;
			конецЕсли;	
		конецЦикла;	
	конецесли;
	
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
			Для каждого стр из Товары Цикл
			Если ЗначениеЗаполнено(стр.Комплектация) Тогда	
				Если не стр.Комплектация.ПометкаУдаления Тогда
				Док = Стр.Комплектация.ПолучитьОбъект();
				Док.Записать(РежимЗаписиДокумента.Проведение);
				конецесли;
			конецЕсли;	
		конецЦикла;	

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ДанныеЗаполнения <> Неопределено Тогда
		//Если ТипЗнч(ДанныеЗаполнения.ЗаявкаОснование.ДокументОснование) = тип("ДокументСсылка.ЗаявкаНаБрак") Тогда
			ДокументОснование = ДанныеЗаполнения.Ссылка;	
			Организация = ДанныеЗаполнения.Организация;
			Подразделение = ДанныеЗаполнения.Подразделение;
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаявкаНаБракРасшифровка.Номенклатура,
			|	ЗаявкаНаБракРасшифровка.ВидДефектаДляУценки,
			|	ЗаявкаНаБракРасшифровка.КоличествоПринято
			|ПОМЕСТИТЬ Заявка
			|ИЗ
			|	Документ.ЗаявкаНаБрак.Расшифровка КАК ЗаявкаНаБракРасшифровка
			|ГДЕ
			|	ЗаявкаНаБракРасшифровка.Ссылка = &СсылкаЗаявка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВозвратТоваровОтПокупателяТовары.Номенклатура,
			|	СУММА(ВозвратТоваровОтПокупателяТовары.Количество) КАК Количество,
			|	ВозвратТоваровОтПокупателяТовары.Склад
			|ПОМЕСТИТЬ Возврат
			|ИЗ
			|	Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
			|ГДЕ
			|	ВозвратТоваровОтПокупателяТовары.Ссылка = &СсылкаВозврат
			|
			|СГРУППИРОВАТЬ ПО
			|	ВозвратТоваровОтПокупателяТовары.Номенклатура,
			|	ВозвратТоваровОтПокупателяТовары.Склад
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Возврат.Номенклатура КАК Номенклатура,
			|	Возврат.Количество КАК Количество,
			|	Заявка.ВидДефектаДляУценки,
			|	Заявка.КоличествоПринято КАК КоличествоПринято,
			|	Возврат.Склад
			|ИЗ
			|	Возврат КАК Возврат
			|		ЛЕВОЕ СОЕДИНЕНИЕ Заявка КАК Заявка
			|		ПО Возврат.Номенклатура = Заявка.Номенклатура
			|ИТОГИ
			|	МАКСИМУМ(Количество),
			|	СУММА(КоличествоПринято)
			|ПО
			|	Номенклатура";
			
			Запрос.УстановитьПараметр("СсылкаВозврат", ДанныеЗаполнения.Ссылка);
			Запрос.УстановитьПараметр("СсылкаЗаявка", ДанныеЗаполнения.ЗаявкаОснование.ДокументОснование);
			
			Результат = Запрос.Выполнить();
			
			ВыборкаНоменклатура = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаНоменклатура.Следующий() Цикл
				Если ВыборкаНоменклатура.Количество > ВыборкаНоменклатура.КоличествоПринято Тогда
					Сообщить("В возврате номенклатуры "+ВыборкаНоменклатура.Номенклатура.Код+" "+ВыборкаНоменклатура.Номенклатура+ " больше чем в заявке на брак");	
				иначе
					ВыборкаДетальныеЗаписи = ВыборкаНоменклатура.Выбрать();
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						строка = Товары.Добавить();
						Строка.Номенклатура = ВыборкаДетальныеЗаписи.номенклатура;
						строка.Дефект = ВыборкаДетальныеЗаписи.ВидДефектаДляУценки;
						строка.Склад =  ВыборкаДетальныеЗаписи.Склад;
						строка.Количество =  ВыборкаДетальныеЗаписи.КоличествоПринято;
						
					КонецЦикла;
				конецЕсли;
			КонецЦикла;
		//иначе
		//	Сообщить("Документ возврата создан не наосновании заявки на брак!");	
		//конецЕсли;	
	конецесли;
КонецПроцедуры
